import {ScrollShadow} from "@heroui/react";



export function CustomStyless() {
  return (
    <div className="w-full p-4  ">
      <ScrollShadow
        hideScrollBar
        className="h-[700px] rounded-xl border border-border/80 bg-linear-to-b from-neutral-50/90 to-white p-4 ring-1 ring-black/5 dark:from-neutral-900/80 dark:to-neutral-900 dark:ring-white/10"
        size={48}
        variant="fade"
      >
        <div className="space-y-3 " >
          
<article dir="rtl" className="space-y-1 text-right text-sm leading-8 text-slate-700">
  <p>
    ری اکت (React) مثل همون شرکت دانش بنیانی هست که دستیار شما میشه تا راحت تر چیزی که در ذهنتون هست رو در رابط کاربری سایت (UI) پیاده سازی کنید بدون اینکه بخواید از سطر کدنویسی انجام بدید. بعد هم با ایجاد بخش‌های مختلف و متصل کردن اونها به همدیگه، صفحات وب جذاب و کامل بسازید.
  </p>

  <p>
    حالا اگه دوست دارید پاسخ سوال «React چیست؟» رو به زبان ساده و خودمونی بگیرید و همینطور کاربرد ری اکت و مزایای اون و اینکه چطور باید یاد گرفت، ما در ادامه مقاله، قدم به قدم با شما جلو میریم تا خیلی خوب و عمیق با تمام ابعاد اون آشنا بشید و از این تخصص پولساز و پردرآمد لذت ببرید.
  </p>

  <p>
    طبق روال همیشگی قبل از هر چیز یک نکته رو یادآوری کنیم که در سرتاسر نوشتن بعضی از محتوای محتوای آموزشی از فرض بر مبتدی بودن کاربر انجام میشه تا مطمئن بشیم همه شما می‌تونید از اونها استفاده کنید؛ اما اگر کاربر حرفه‌ای هستید و با اصول و تعاریف هر موضوع آشنایی کامل دارید، می‌تونید از بخش‌های اولیه محتوا بگذرید و به راحتی وارد بخش‌های بعدی بشید.
  </p>

  <p>حالا بپردازیم در ادامه این مقاله قراره از کجا به کجا برسیم؟!</p>

  <ul>
    <li>ری اکت چیست؟ و چگونه کار می‌کند؟</li>
    <li>ویژگی‌ها و مزایای ری اکت چیست؟</li>
    <li>پیش‌نیازها و ابزارهای مورد نیاز برای یادگیری ری اکت</li>
    <li>مسیر حرفه‌ای تر شدن در طراحی رابط کاربری با ری اکت</li>
    <li>بازار کار برنامه نویسی فرانت اند با ری اکت</li>
  </ul>

  <p>
    پس طبق معمول با تمرکز بالا همراه ما باشید تا خیلی خوب و عمیق، ری اکت رو بشناسید و یاد بگیرید.
  </p>

  <h2>ری اکت یا React چیست؟ و چگونه کار می‌کند؟</h2>

  <p>
    اول ببینیم که حرف حساب کتاب‌ها و داکیومنت‌ها برای تعریف این چی‌هاست؟
  </p>

  <p>
    «ری اکت یا React یک کتابخانه متن‌باز جاوااسکریپتی (Open Source) برای ساخت و توسعه رابط کاربری (UI) است که در سال ۲۰۱۱ توسط Facebook تولید و طی دو سال بعد توسعه و در اختیار عموم قرار گرفت. این تکنولوژی با استفاده از مفهوم کامپوننت (Component) به عنوان جز و بخشی از قابلیت استفاده مجدد، امکان طراحی صفحات پویا و واکنش‌گرا رو فراهم کرده است.»
  </p>
</article>
         
        </div>
      </ScrollShadow>
    </div>
  );
}